Revit 2027 API
DocumentSavedAsEventArgs.OriginalPath Property
 Original path of the document.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string OriginalPath { get; }
Public ReadOnly Property OriginalPath As String
	Get
public:
property String^ OriginalPath {
	String^ get ();
}
member OriginalPath : string with get
Property Value
String
See Also
Reference
DocumentSavedAsEventArgs Class
Autodesk.Revit.DB.Events Namespace